literate/ParserTests.org
#+TITLE: Parser Tests
#+PROPERTY: header-args    :comments both :tangle ../test/Parser.test.js

* Preamble

#+begin_src js
import * as Parser from "../src/Parser";
import * as Block from "../src/Block";
#+end_src

* Tests

#+begin_src js
it("Parses a single blank", () => {
    const tree = Parser.single("_")
    expect(tree).toEqual(Block.Blank())
})
#+end_src

Turning off these tests since I'm not ready for them, got to build them machine first.

#+begin_src js
it.skip("Parses a big integer", () => {
    const tree = Parser.single("33554432")
    expect(tree).toEqual(Block.Number(33554432))
})

it.skip("Parses a string", () => {
    const tree = Parser.single("\"Hello\"")
    expect(tree).toEqual(Block.String("Hello"))
})
#+end_src
